{

	"parameters": {

		"minCheckCadence": "00:00:01",
		"maxCheckCadence": "00:00:01",
		"minBreak": "00:07:00",
		"nextWorkDayStartsAt": "04:00:00",

		"voice": {
			"culture": "en-US",
			"device": "Realtek",
			"gender": "Female",
			"dontSwitchDuringCall": true,
			"switchBackToPreviousDevice": true
		},

		"buddy": {
			"emailFrom": "***@gmail.com",
			"emailFromPassword": "***",
			"emailTo": "***@e2t.link"
		},

		"logging": true

	},

	"sensors": {

		// Mouse and keyboard input will count as activity
		"windowsInput": {
			"enabled": true
		},

		// Calls on this computer will count as activity. Calls are detected by process name (making sure it also has a UDP network connection open)
		"calls": {
			"enabled": true,
			"processes": "zoom, teams, slack"
		}
	},

	"reports": {
		"enabled": true
	},

	"rules": {

		// The app can use its voice on startup to give feedback that it's running
		"startup": {
			"say": "Let's go"
		},

		// This will remind you to go back to work after a break, with regular follow ups
		"backToWork": {
			"time": "00:20:00",
			"followUp": "00:20:00",
			"say": "Scoot back to work now!",
			"escalate": {
				"after": 3,
				"text": "Your buddy is refusing to go back to work now. May need a little nudge.",
				"then": "stop"
			},
			"until": "19:00:00"
		},

		// This will remind you to take a break after working for the specified stretch of time, with regular follow ups
		"takeABreak": {
			"time": "01:40:00",
			"skipDuringCall": true,
			"followUp": "00:10:00",
			"sayInOrder": [
				"Time to wrap up!",
				"Alright buddy let's take a break now",
				"This is the last warning!",
				"Ok you're screwed now",
				"Come on what's wrong with you, stop working!",
				"Why am I even spending energy on these notifications. Last try. Stop working!"
			],
			"popup": true,
			"escalate": {
				"after": 3, // Will trigger after X reminders
				"text": "Your little friend is at it again. Needs unsticking.",
				"then": "reset"
			}
		},

		// This will remind you to stop working after reaching a specified amount of work time in a day and keep reminding you with the specified rate of follow up
		"stopWorking": {
			"time": "08:00:00",
			"followUp": "00:30:00",
			"say": "It seems like you've worked for {0} hours today. How about you quit already?",
			"popup": true,
			"escalate": {
				"after": 3, // Will trigger after X reminders
				"text": "Important information. Your little friend has already worked for {0} hours today. I'm just going to leave this here. But I think this calls for serious measures.",
				"then": "reset"
			}
		},

		// This will remind you to stop working at a specified time of day and keep reminding you with the specified rate of follow up, regardless of how much you've worked
		"itsLate": {
			"time": "22:00:00",
			"followUp": "00:30:00",
			"popup": true,
			"say": "It's very late now. What can you do to shift this work to tomorrow?"
		},

		// This will mute the speaker after the specified time when you're inactive for a bit, to avoid hearing work notifications from your laptop if you're running it overnight
		"dnd": {
			"from": "19:00:00",
			"to": "07:00:00"
		}

	}

}

